DEFAULT_FOLDER = r"F:\WaitAndDel\1"

FILE_EXTENSIONS = [
    ".apk", ".DS_Store", ".torrent", ".chm", ".mhtml", ".html", ".htm", ".w3x", ".7z", ".rar"
]

FOLDER_NAMES = [
    "金三角萝莉禁区", "摸摸漫画", "窥视TV最强重口缺稀视频平台", "18禁成人游戏", "免费黃油", "18禁成人游戏四款附带礼包码",
    "海角乱伦社区全球最大乱伦平台", "缅北禁地最大的东南亚揭秘平台", "18禁成人游戏八款附带礼包码",
    "18禁成人游戏七款附带礼包码", "母狗园反差素人绿帽天堂", "外网天堂数亿片源全部白嫖",
    "最新地址", "18禁成人游戏六款附带礼包码", "小蓝俱乐部全球同志看片平台日更500部",
    "原创文宣", "1024社区发布器 10.1版"
]

SPECIFIC_FILE_NAMES = [
    "影视吧在线看片", "79_1_bd184287e8e47cd", "摸摸漫画", "工口漫画", "无限视频手机看片", "免费黃油",
    "17B2CDEEA0271501EDCF97FB52D530E3626D1A97", "64686", "( 扫码下载1024安卓APP_3.0 )",
    "社区发布器", "1024社区发布器 10.1版.zip", "最新地址.zip.zip", "最新地址.zip",
    "资源共享","低画质预览", "66.mp4", "18禁成人游戏六款附带礼包码"
]


DEFAULT_REQUEST_INTERVAL = 3  # 默认请求间隔为 3 秒
